{
  "welcome": {
    "title": "Welcome to Tribos",
    "subtitle": "Your AI-powered training companion for cyclists",
    "description": "Tribos helps you train smarter by combining route planning, workout scheduling, and AI coaching into one seamless experience. Whether you're preparing for your first century or your next race, we've got the tools to help you get there."
  },
  "features": [
    {
      "id": "plan-vs-analysis",
      "category": "Core Features",
      "title": "Plan Your Training vs Training Analysis",
      "icon": "calendar-chart",
      "items": [
        {
          "name": "Plan Your Training",
          "description": "Your interactive training calendar. Drag and drop workouts onto your schedule, build out your training weeks, and see your planned Training Stress Score (TSS) alongside completed activities. Think of it as your whiteboard for mapping out what's ahead.",
          "highlight": "Build your schedule visually"
        },
        {
          "name": "Training Analysis",
          "description": "Dive deep into completed rides. View your route on the map, analyze power and heart rate metrics, see intensity breakdowns, and understand how each ride contributes to your fitness. This is where you review what you've done.",
          "highlight": "Analyze past performance"
        }
      ],
      "summary": "Plan looks forward. Analysis looks back. Use both to train with intention."
    },
    {
      "id": "ai-coaches",
      "category": "AI Features",
      "title": "Meet Your AI Coaches",
      "icon": "robot",
      "description": "Three distinct AI personalities, each designed for a specific part of your training journey.",
      "items": [
        {
          "name": "Training Coach",
          "description": "Need workout ideas? The Training Coach suggests specific sessions based on your goals and recent activity. Get recommendations you can add to your calendar with one click.",
          "highlight": "What should I ride today?"
        },
        {
          "name": "Accountability Coach",
          "description": "Life gets busy. The Accountability Coach keeps you honest—tracking your weekly compliance, remembering your goals, and giving you the nudge (or reality check) you need to stay consistent.",
          "highlight": "Your no-excuses training partner"
        },
        {
          "name": "Training Strategist",
          "description": "Thinking bigger picture? The Strategist helps with periodization, race prep, and long-term planning. Have strategic conversations about building toward your goals.",
          "highlight": "Plan your season, not just your week"
        }
      ]
    }
  ],
  "updates": [
    {
      "id": "route-builder-manual-mode",
      "date": "2026-02",
      "type": "new",
      "title": "Route Builder - Manual Mode",
      "description": "Take full control of your routes. Click to place waypoints, drag to adjust, and build exactly the ride you want with real-time elevation and surface info.",
      "details": [
        "Draggable waypoints with snap-to-roads or freehand drawing",
        "Gradient-colored route line showing slope and surface type overlay",
        "Elevation profile with click-drag selection and section metrics"
      ]
    },
    {
      "id": "ai-route-editing",
      "date": "2026-02",
      "type": "new",
      "title": "AI-Assisted Route Editing",
      "description": "Edit your routes with natural language. Tell the AI what you want — add a hill, avoid a road, extend the loop — and watch it adjust your route in real time.",
      "details": [
        "Natural language commands to reshape your route",
        "Smart POIs along your route — water, food, bike shops, viewpoints",
        "Compare 2-3 segment alternatives between any two waypoints"
      ]
    },
    {
      "id": "training-plan-calendar",
      "date": "2026-02",
      "type": "new",
      "title": "Training Plans on Your Calendar",
      "description": "Your AI coach can now build structured training plans and place them directly onto your calendar. Plans adapt to your schedule and the coach remembers your history across sessions.",
      "details": [
        "AI-generated plans dropped straight onto your training calendar",
        "Coach memory across sessions for smarter recommendations",
        "Schedule-aware planning that respects your availability"
      ]
    },
    {
      "id": "coach-redesign",
      "date": "2026-02",
      "type": "improvement",
      "title": "AI Coach Experience Redesign",
      "description": "A faster, more integrated coaching experience. Access your coach from a spotlight-style command bar and get proactive suggestions right on your dashboard.",
      "details": [
        "Spotlight-style command bar for quick coach access",
        "Inline CoachCard with proactive training suggestions",
        "Unified workout recommendations across all surfaces"
      ]
    },
    {
      "id": "garmin-reliability",
      "date": "2026-02",
      "type": "improvement",
      "title": "Garmin Sync Reliability",
      "description": "Major reliability overhaul for Garmin data syncing. Your rides now process more consistently, and you'll get a heads-up if your connection ever needs attention.",
      "details": [
        "Fixed webhook processing for more reliable activity imports",
        "Proactive alerts when your Garmin connection needs attention",
        "Improved token refresh and rate limiting"
      ]
    },
    {
      "id": "ride-data-accuracy",
      "date": "2026-02",
      "type": "improvement",
      "title": "Ride Data Accuracy Fixes",
      "description": "Cleaned up ride summary calculations so your numbers are accurate. Bad sensor values are now filtered out and Work (kJ) is calculated correctly.",
      "details": [
        "FIT file sentinel values filtered from summaries",
        "Corrected Work (kJ) calculation",
        "Force-reprocess mode for fixing historical rides"
      ]
    },
    {
      "id": "the-cafe",
      "date": "2025-01",
      "type": "new",
      "title": "The Cafe - Community & Accountability",
      "description": "Find your people. Join small groups of 5-10 cyclists with similar goals for weekly check-ins, discussions, and accountability. Like meeting up at your favorite cafe stop, but online.",
      "details": [
        "Weekly check-ins to share reflections, not ride spam",
        "Discussion threads for training questions and advice",
        "Goal-matched groups so you train with like-minded riders"
      ]
    },
    {
      "id": "iterative-routing",
      "date": "2025-01",
      "type": "improvement",
      "title": "Smarter Route Generation",
      "description": "Routes now build segment-by-segment along real roads, giving you more natural loops that hit your target distance accurately. No more weird detours or off-road surprises.",
      "details": [
        "Routes follow actual road networks",
        "More accurate distance targeting",
        "Better loop shapes that make sense"
      ]
    }
  ],
  "comingSoon": [
    {
      "title": "Google Calendar sync",
      "description": "Import your busy times so training plans work around your life"
    },
    {
      "title": "Enhanced analytics",
      "description": "Deeper insights into your training trends"
    }
  ]
}
